AlphaStudioDE/SnapHeater-U1/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c3"
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_HZ=1000
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_ESP_TASK_WDT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=8
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Development defaults. Change with: idf.py menuconfig
CONFIG_SHU1_WIFI_SSID="YOUR_WIFI"
CONFIG_SHU1_WIFI_PASSWORD="YOUR_PASSWORD"
CONFIG_SHU1_MOONRAKER_HOST="192.168.1.100"
CONFIG_SHU1_MOONRAKER_PORT=7125

# Candidate Panda Breath pin map. Verify physically before enabling live output.
CONFIG_SHU1_HEATER_GPIO=18
CONFIG_SHU1_FAN_GPIO=3
CONFIG_SHU1_BUTTON_GPIO=-1
CONFIG_SHU1_STATUS_LED_GPIO=-1
CONFIG_SHU1_CHAMBER_ADC_CH=0
CONFIG_SHU1_PTC_ADC_CH=1
CONFIG_SHU1_HEATER_ACTIVE_HIGH=y
CONFIG_SHU1_FAN_ACTIVE_HIGH=y

# Hard safety defaults: normal heater output and probe API disabled.
CONFIG_SHU1_ENABLE_HEATER_OUTPUT=n
CONFIG_SHU1_ENABLE_GPIO_PROBE=n
CONFIG_SHU1_MAX_HEATER_PROBE_MS=300
CONFIG_SHU1_MAX_FAN_PROBE_MS=3000

# Conservative NTC assumptions. Must be tuned after reading PCB resistor values.
CONFIG_SHU1_NTC_BETA=3950
CONFIG_SHU1_NTC_R0_OHM=100000
CONFIG_SHU1_NTC_SERIES_OHM=100000
CONFIG_SHU1_ADC_OPEN_RAW_MIN=50
CONFIG_SHU1_ADC_SHORT_RAW_MAX=4050

# Policy based on multi-version functional extraction.
CONFIG_SHU1_TARGET_TEMP_C=50
CONFIG_SHU1_MAX_TARGET_TEMP_C=60
CONFIG_SHU1_OVERTEMP_C=70
CONFIG_SHU1_PTC_CUTOFF_C=104
CONFIG_SHU1_FILTER_TRIGGER_BED_C=30
CONFIG_SHU1_HEATER_TRIGGER_BED_C=80

# BLE / Android local control. Uses ESP-IDF NimBLE host.
CONFIG_SHU1_ENABLE_BLE=y
CONFIG_SHU1_BLE_DEVICE_NAME="SnapHeater U1"
CONFIG_SHU1_BLE_REQUIRE_PIN_FOR_CONTROL=y
CONFIG_SHU1_BLE_CONTROL_PIN="123456"
CONFIG_SHU1_BLE_NOTIFY_PERIOD_MS=2000
CONFIG_SHU1_BLE_MAX_WRITE_BYTES=1024
CONFIG_SHU1_BLE_MAX_READ_BYTES=2048

# ESP-IDF Bluetooth / NimBLE defaults for ESP32-C3.
CONFIG_BT_ENABLED=y
CONFIG_BT_BLE_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=256

# v0.7 smart heating policy defaults.
CONFIG_SHU1_DEFAULT_FAN_POSTRUN_MIN=5
CONFIG_SHU1_DEFAULT_TEMPERING_ENABLED=y
CONFIG_SHU1_DEFAULT_TEMPERING_END_TEMP_C=35
CONFIG_SHU1_DEFAULT_TEMPERING_DURATION_MIN=30
